In [1]:
import pandas as pd
df = pd.read_csv(r"D:\MY_ML\homepriceswithdummy.csv")
df

     town  area   price
0  mumbai  2600  550000
1  mumbai  3000  565000
2    pune  2600  585000
3    pune  3300  650000
4   thane  2600  575000
5   thane  2900  600000

In [3]:
dummies=pd.get_dummies(df.town)                 #help to create dummy cloumns with binary variables
dummies

   mumbai  pune  thane
0       1     0      0
1       1     0      0
2       0     1      0
3       0     1      0
4       0     0      1
5       0     0      1

In [5]:
merged = pd.concat([df,dummies],axis="columns")   #concatinaded 2 tables 
merged

     town  area   price  mumbai  pune  thane
0  mumbai  2600  550000       1     0      0
1  mumbai  3000  565000       1     0      0
2    pune  2600  585000       0     1      0
3    pune  3300  650000       0     1      0
4   thane  2600  575000       0     0      1
5   thane  2900  600000       0     0      1

In [8]:
final = merged.drop(['town','thane'],axis="columns")            #drop any 1 dummy column because of dummy variable trap
final

   area   price  mumbai  pune
0  2600  550000       1     0
1  3000  565000       1     0
2  2600  585000       0     1
3  3300  650000       0     1
4  2600  575000       0     0
5  2900  600000       0     0

In [12]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [14]:
X=final.drop('price',axis="columns") #accept price all are independent variable , drop 'price' column and make a seperate table
X

   area  mumbai  pune
0  2600       1     0
1  3000       1     0
2  2600       0     1
3  3300       0     1
4  2600       0     0
5  2900       0     0

In [15]:
Y=final.price                   #its dependent variable(column)
Y

0    550000
1    565000
2    585000
3    650000
4    575000
5    600000
Name: price, dtype: int64

In [16]:
model.fit(X,Y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [19]:
model.predict([[2600,0,1]])       #to find house rate in pune 0,1

array([589594.59459451])

In [22]:
model.predict([[3900,0,0]])       #to find house rate in thane 0,0

array([679189.18918957])

In [23]:
model.score(X,Y)

0.9697803710023668

In [24]:
df

     town  area   price
0  mumbai  2600  550000
1  mumbai  3000  565000
2    pune  2600  585000
3    pune  3300  650000
4   thane  2600  575000
5   thane  2900  600000

In [25]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [27]:
dfle=df
le.fit_transform(dfle.town)

array([0, 0, 1, 1, 2, 2])

In [28]:
dfle.town=le.fit_transform(dfle.town)  #fit_transform means it takes the lable column as an i/p and it will return the lable
dfle

   town  area   price
0     0  2600  550000
1     0  3000  565000
2     1  2600  585000
3     1  3300  650000
4     2  2600  575000
5     2  2900  600000

In [30]:
X=dfle[['town','area']].values  #.values because we want X as 2d array
X

array([[   0, 2600],
       [   0, 3000],
       [   1, 2600],
       [   1, 3300],
       [   2, 2600],
       [   2, 2900]], dtype=int64)

In [31]:
Y=dfle.price
Y

0    550000
1    565000
2    585000
3    650000
4    575000
5    600000
Name: price, dtype: int64

In [37]:
from sklearn.preprocessing import OneHotEncoder
ohe=OneHotEncoder(categorical_features=[0])

In [38]:
X=ohe.fit_transform(X).toarray()
X

D:\Anaconda\lib\site-packages\sklearn\preprocessing\_encoders.py:415: FutureWarning: The handling of integer data will change in version 0.22. Currently, the categories are determined based on the range [0, max(values)], while in the future they will be determined based on the unique values.
If you want the future behaviour and silence this warning, you can specify "categories='auto'".
In case you used a LabelEncoder before this OneHotEncoder to convert the categories to integers, then you can now use the OneHotEncoder directly.
  warnings.warn(msg, FutureWarning)
D:\Anaconda\lib\site-packages\sklearn\preprocessing\_encoders.py:451: DeprecationWarning: The 'categorical_features' keyword is deprecated in version 0.20 and will be removed in 0.22. You can use the ColumnTransformer instead.
  "use the ColumnTransformer instead.", DeprecationWarning)

array([[0., 1., 0., 0., 1., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 1., 0.],
       [1., 0., 1., 0., 1., 0., 0., 0.],
       [1., 0., 1., 0., 0., 0., 0., 1.],
       [1., 0., 0., 1., 1., 0., 0., 0.],
       [1., 0., 0., 1., 0., 1., 0., 0.]])

In [39]:
X=X[:,1:]
X

array([[1., 0., 0., 1., 0., 0., 0.],
       [1., 0., 0., 0., 0., 1., 0.],
       [0., 1., 0., 1., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 1.],
       [0., 0., 1., 1., 0., 0., 0.],
       [0., 0., 1., 0., 1., 0., 0.]])

In [41]:
model.fit(X,Y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)